Documents/СменноеЗадание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СменноеЗадание</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСменныхЗаданий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Участок</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеУчастки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Смена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Исполнители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исполнитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Бригады</v8:Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ОперацииКСозданиюСменныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ОперацииКСозданиюСменныхЗаданий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяШтучное</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяПЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВремяВыполнения</Name>
					<Comment>Реквизит является справочным, так как рассчитывается с округлением на основании времени штучного и времени ПЗ</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяЕдИзм</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МожноНазначать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НужноНазначать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НарушенПорядокНазначения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Распоряжение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство2_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСледующейОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СменноеЗадание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СменноеЗадание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭтапПроизводства2_2</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТехнологическиеОперации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОперации</Name>
					<Comment>Уникальный идентификатор операции в маршрутной карте</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Бригады</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидРабочегоЦентра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначатьНеРанее</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыСменныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтатусыСменныхЗаданий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Формируется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сформировано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закрыто</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыПроизводственныхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СтатусыПроизводственныхОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВыполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пропущена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/СменноеЗадание/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		ДанныеЗаполнения.Свойство("Дата",          Дата);
		ДанныеЗаполнения.Свойство("Подразделение", Подразделение);
		ДанныеЗаполнения.Свойство("Смена",         Смена);
		ДанныеЗаполнения.Свойство("Участок",       Участок);
		
		Если ДанныеЗаполнения.Свойство("ЗаполнитьИсполнителейИзПрошлойСмены")
			И ДанныеЗаполнения.ЗаполнитьИсполнителейИзПрошлойСмены Тогда
			
			Запрос = Новый Запрос(
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	СменноеЗаданиеИсполнители.Ссылка КАК Ссылка
				|ПОМЕСТИТЬ ВТСсылка
				|ИЗ
				|	Документ.СменноеЗадание КАК СменноеЗадание
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СменноеЗадание.Исполнители КАК СменноеЗаданиеИсполнители
				|		ПО СменноеЗадание.Ссылка = СменноеЗаданиеИсполнители.Ссылка
				|ГДЕ
				|	СменноеЗадание.Подразделение = &Подразделение
				|	И СменноеЗадание.Смена = &Смена
				|	И СменноеЗадание.Участок = &Участок
				|	И СменноеЗадание.Дата < &Дата
				|	И СменноеЗадание.ПометкаУдаления = ЛОЖЬ
				|
				|УПОРЯДОЧИТЬ ПО
				|	СменноеЗадание.Дата УБЫВ
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	СменноеЗаданиеИсполнители.Исполнитель КАК Исполнитель
				|ИЗ
				|	ВТСсылка КАК ВТСсылка
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СменноеЗадание.Исполнители КАК СменноеЗаданиеИсполнители
				|		ПО ВТСсылка.Ссылка = СменноеЗаданиеИсполнители.Ссылка");
			Запрос.УстановитьПараметр("Подразделение", Подразделение);
			Запрос.УстановитьПараметр("Смена", Смена);
			Запрос.УстановитьПараметр("Дата", Дата);
			Запрос.УстановитьПараметр("Участок", Участок);
			
			Исполнители.Загрузить(Запрос.Выполнить().Выгрузить());
			
		КонецЕсли;
		
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	ПараметрыПодразделения = ПроизводствоСервер.ПараметрыПроизводственногоПодразделения(Подразделение);
	
	Если НЕ ПараметрыПодразделения.ИспользоватьСмены Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Смена");
	КонецЕсли;
	
	Если НЕ ПараметрыПодразделения.ИспользоватьУчастки Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Участок");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ДанныеДоИзменения = ДанныеДокументаДоИзменения();
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	ДополнительныеСвойства.Вставить("ДанныеДоИзменения", ДанныеДоИзменения);
	
	// Контроль: отменять проведение можно только в статусе Формируется
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
		И Статус <> Перечисления.СтатусыСменныхЗаданий.Формируется Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Для выполнения действия документ должен иметь статус ""Формируется"".';uk='Для виконання дії документ повинен мати статус ""Формується"".'"),
			ЭтотОбъект,,,
			Отказ);
		
	КонецЕсли;
	
	// Контроль: по сочетанию смена-день-участок должен быть только один документ
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ИСТИНА КАК Поле1
			|ИЗ
			|	Документ.СменноеЗадание КАК СменноеЗадание
			|ГДЕ
			|	СменноеЗадание.Ссылка <> &Ссылка
			|	И СменноеЗадание.Подразделение = &Подразделение
			|	И СменноеЗадание.Смена = &Смена
			|	И СменноеЗадание.Участок = &Участок
			|	И НАЧАЛОПЕРИОДА(СменноеЗадание.Дата, ДЕНЬ) = &Дата
			|	И СменноеЗадание.Проведен");
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
		Запрос.УстановитьПараметр("Смена", Смена);
		Запрос.УстановитьПараметр("Участок", Участок);
		Запрос.УстановитьПараметр("Дата", НачалоДня(Дата));
		
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru='В системе уже имеется сменное задание за указанную дату.';uk='В системі вже є змінне завдання за вказану дату.'"),
				ЭтотОбъект,,,
				Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Контроль: подразделение можно изменять если нет назначенных операций
	Если ДанныеДоИзменения.Подразделение <> Подразделение Тогда
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ИСТИНА КАК Поле1
			|ИЗ
			|	РегистрСведений.ОперацииКСозданиюСменныхЗаданий КАК Регистр
			|ГДЕ
			|	Регистр.СменноеЗадание = &СменноеЗадание
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	ИСТИНА
			|ИЗ
			|	Документ.ПроизводственнаяОперация2_2 КАК Документ
			|ГДЕ
			|	Документ.СменноеЗадание = &СменноеЗадание");
		Запрос.УстановитьПараметр("СменноеЗадание", Ссылка);
		
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru='Имеются операции, назначенные сменному заданию. Изменять подразделение запрещено.';uk='Є операції, призначені змінному завданню. Змінювати підрозділ заборонено.'"),
				ЭтотОбъект,,,
				Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Контроль: статус производственных операций (документ в статусе Формируется)
	Если Статус = Перечисления.СтатусыСменныхЗаданий.Формируется И НЕ ЭтоНовый() Тогда
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ИСТИНА КАК Поле1
			|ИЗ
			|	Документ.ПроизводственнаяОперация2_2 КАК ПроизводственнаяОперация2_2
			|ГДЕ
			|	ПроизводственнаяОперация2_2.СменноеЗадание = &СменноеЗадание
			|	И ПроизводственнаяОперация2_2.Статус <> &Статус
			|	И ПроизводственнаяОперация2_2.Проведен");
		
		Запрос.УстановитьПараметр("СменноеЗадание", Ссылка);
		Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыПроизводственныхОпераций.Создана);
		
		Если НЕ Запрос.Выполнить().Пустой() Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru='Имеются производственные операции в статусе отличном от ""Создана"".';uk='Є виробничі операції в статусі відмінному від ""Створено"".'"),
				ЭтотОбъект,,,
				Отказ);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Контроль: статус производственных операций (документ в статусе Закрыто)
	Если Статус = Перечисления.СтатусыСменныхЗаданий.Закрыто И НЕ ЭтоНовый() Тогда
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ИСТИНА КАК ОшибкаСтатус,
			|	ЛОЖЬ КАК ОшибкаПроведение
			|ИЗ
			|	Документ.ПроизводственнаяОперация2_2 КАК ПроизводственнаяОперация2_2
			|ГДЕ
			|	ПроизводственнаяОперация2_2.СменноеЗадание = &СменноеЗадание
			|	И НЕ ПроизводственнаяОперация2_2.Статус В (&Статусы)
			|	И ПроизводственнаяОперация2_2.Проведен
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЛОЖЬ,
			|	ИСТИНА
			|ИЗ
			|	Документ.ПроизводственнаяОперация2_2 КАК ПроизводственнаяОперация2_2
			|ГДЕ
			|	ПроизводственнаяОперация2_2.СменноеЗадание = &СменноеЗадание
			|	И НЕ ПроизводственнаяОперация2_2.Проведен
			|	И НЕ ПроизводственнаяОперация2_2.ПометкаУдаления");
		
		Запрос.УстановитьПараметр("СменноеЗадание", Ссылка);
			
		Статусы = Новый Массив;
		Статусы.Добавить(Перечисления.СтатусыПроизводственныхОпераций.Выполнена);
		Статусы.Добавить(Перечисления.СтатусыПроизводственныхОпераций.НеВыполнена);
		Статусы.Добавить(Перечисления.СтатусыПроизводственныхОпераций.Пропущена);
		Запрос.УстановитьПараметр("Статусы", Статусы);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если Выборка.ОшибкаСтатус Тогда
				ТекстСообщения = НСтр("ru='Имеются производственные операции в статусе отличном от ""Выполнена"", ""Не выполнена"" и ""Пропущена"".';uk='Є виробничі операції в статусі відмінному від ""Виконано"", ""Не виконано"" і ""Пропущено"".'");
			Иначе
				ТекстСообщения = НСтр("ru='Имеются непроведенные производственные операции.';uk='Є непроведені виробничі операції.'");
			КонецЕсли;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект,,, Отказ);
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Приведение даты к началу смены
	Если ЭтоНовый() ИЛИ ДанныеДоИзменения.Смена <> Смена ИЛИ ДанныеДоИзменения.Дата <> Дата Тогда
		
		Расписание = КалендарныеГрафики.РасписанияРаботыНаПериод(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Смена),
			НачалоДня(Дата), КонецДня(Дата));
		
		Если Расписание.Количество() > 0 И ЗначениеЗаполнено(Расписание[0].ВремяНачала) Тогда
			Дата = НачалоДня(Дата) + Час(Расписание[0].ВремяНачала)*3600 + Минута(Расписание[0].ВремяНачала)*60;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Обновление связанных данных
	Если ДополнительныеСвойства.РежимЗаписи = РежимЗаписиДокумента.Проведение
		И НЕ ДополнительныеСвойства.ЭтоНовый
		И ДополнительныеСвойства.ДанныеДоИзменения.Дата <> Дата Тогда
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Регистр.Этап КАК Этап
			|ИЗ
			|	РегистрСведений.ОперацииКСозданиюСменныхЗаданий КАК Регистр
			|ГДЕ
			|	Регистр.СменноеЗадание = &СменноеЗадание
			|
			|ОБЪЕДИНИТЬ
			|
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Документ.Этап
			|ИЗ
			|	Документ.ПроизводственнаяОперация2_2 КАК Документ
			|ГДЕ
			|	Документ.СменноеЗадание = &СменноеЗадание
			|	И Документ.Проведен
			|	И Документ.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыПроизводственныхОпераций.НеВыполнена)");
		Запрос.УстановитьПараметр("СменноеЗадание", Ссылка);
		
		Попытка
			
			РегистрыСведений.ОперацииКСозданиюСменныхЗаданий.РассчитатьОперации(
				Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Этап"));
			
		Исключение
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru='Не удалось рассчитать операции к созданию сменных заданий.';uk='Не вдалося розрахувати операції до створення змінних завдань.'"),
				ЭтотОбъект,,,
				Отказ);
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Попытка
		
		РегистрыСведений.ОперацииКСозданиюСменныхЗаданий.УдалитьОперацииЗадания(Ссылка);
		
	Исключение
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru='Не удалось рассчитать операции к созданию сменных заданий.';uk='Не вдалося розрахувати операції до створення змінних завдань.'"),
			ЭтотОбъект,,,
			Отказ);
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеДокументаДоИзменения()
	
	СоставРеквизитов = "Дата,Подразделение,Смена";
	
	ДанныеДоИзменения = Новый Структура(СоставРеквизитов);
	
	Если НЕ ЭтоНовый() Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ " + СоставРеквизитов + "
		|ИЗ
		|	Документ.СменноеЗадание КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
		
		ЗаполнитьЗначенияСвойств(ДанныеДоИзменения, Запрос.Выполнить().Выгрузить()[0]);
		
	Иначе
		
		ЗаполнитьЗначенияСвойств(ДанныеДоИзменения, ЭтотОбъект);
		
	КонецЕсли;
	
	Возврат ДанныеДоИзменения;
	
КонецФункции

#КонецОбласти

#КонецЕсли
